# Рекурсивна функція
# Завдання №10: Перевернути цифри числа

def reverse(n, result=0):
    """
    Рекурсивна функція для перевертання цифр числа.
    n (int) - число, яке треба перевернути
    result (int) - накопичувач результату (за замовчуванням 0)
    int - число з цифрами в зворотному порядку
    (1234, 0) =остання цифра 4
    (123, 4) = остання цифра 3, result = 4*10 + 3 = 43
    (12, 43) =остання цифра 2, result = 43*10 + 2 = 432
    (1, 432) = остання цифра 1, result = 432*10 + 1 = 4321
    """
    if n == 0:
        return result
    lastdigit = n % 10  # Остання цифра (наприклад, 4 з 1234)
    ostasha = n // 10  # Решта числа (наприклад, 123 з 1234)
    new_result = result * 10 + lastdigit  # Додаємо цифру до результату

    return reverse(ostasha, new_result)

    # 1. Беремо останню цифру (n % 10)
    # 2. Додаємо її до результату (result * 10 + остання цифра)
    # 3. Викликаємо функцію для решти числа (n // 10)
# --------
print("Приклад 1: 1234 =", reverse(1234))
print("Приклад 2: 5 =", reverse(5))
print("Приклад 3: 9876 =", reverse(9876))
print("Приклад 4: 100 =", reverse(100))
print("Приклад 5: 12321 =", reverse(12321))